---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.SurfaceType
source: html/209d04c9-1ea3-055f-0fea-5467ed9c9c3e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.SurfaceType Property

The analytical surface type.

## Syntax (C#)
```csharp
public EnergyAnalysisSurfaceType SurfaceType { get; }
```